app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def ensure_current_user
    unless Book.find(params[:id]).user.id.to_i == current_user.id

SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "テスト投稿タイトル"], ["body", "ppo"], ["user_id", 2], ["created_at", "2022-01-04 09:59:29.233342"], ["updated_at", "2022-01-04 09:59:29.233342"]]
---
  def create
    @books = Book.all
    @user = current_user
    @book_new = Book.new(book_params)
    @book_new.user_id = current_user.id
    if @book_new.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def update
    @book = Book.find(params[:id])