app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def ensure_current_user
    unless User.find(params[:id]) == current_user

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", nil], ["updated_at", "2021-12-28 11:56:21.068615"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)